---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralDisplayInHiddenViews
source: html/2a13b9b8-6c4c-5d5d-5820-032278108fb6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralDisplayInHiddenViews Property

"Display in Hidden Views"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralDisplayInHiddenViews { get; }
```